app/controllers/party_clubs_controller.rb

SELECT * FROM "clubs"
---
  def index
    @clubs = Club.all

SELECT * FROM "clubs" WHERE ("clubs"."id" = 0 AND ("clubs".party_id = 1))
---
  def show
    @club = @party.club.find(params[:id])

SELECT * FROM "parties" WHERE ("parties"."id" = 1)
---
  def load_party
    @party = Party.find(params[:party_id])